Revit 2026 API

# ViewSheetSetSheetOrganizationId Property

---

ElementId to the BrowserOrganization for sheets.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ElementId SheetOrganizationId { get; set; }
```
```vb
Public Overridable Property SheetOrganizationId As ElementId
	Get
	Set
```
```cpp
public:
virtual property ElementId^ SheetOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
abstract SheetOrganizationId : ElementId with get, set
override SheetOrganizationId : ElementId with get, set
```

#### Property Value

ElementId

#### Implements

IViewSheetSetSheetOrganizationId

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible. |

Ignored when [!:Autodesk::Revit::DB::PrintSetup::IsAutomatic] is .

#### Reference

ViewSheetSet Class

Autodesk.Revit.DB Namespace